Revit 2027 API
AdaptiveComponentFamilyUtils.GetNumberOfShapeHandlePoints Method
 Gets number of Shape Handle Point Elements in Adaptive Component Family.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static int GetNumberOfShapeHandlePoints(
	Family family
)
Public Shared Function GetNumberOfShapeHandlePoints (
	family As Family
) As Integer
public:
static int GetNumberOfShapeHandlePoints(
	Family^ family
)
static member GetNumberOfShapeHandlePoints :
        family : Family -> int
Parameters
family Family
 The Family
Return Value
Int32
 Number of Adaptive Shape Handle Point Element References in the Adaptive Component Family.
Exceptions
Exception | Condition
ArgumentException |  The Family family is not an Adaptive Component Family.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  This operation failed.
See Also
Reference
AdaptiveComponentFamilyUtils Class
Autodesk.Revit.DB Namespace